/*
 * @Author: liuranyang liuranyang@cncaea.cn
 * @Date: 2026-01-29 16:33:13
 * @LastEditors: liuranyang liuranyang@cncaea.cn
 * @LastEditTime: 2026-01-29 17:22:50
 * @FilePath: \FR30xxC-SDK-v0.3.1\examples\application\btdm_audio\Src\Hmi\Hmi.h
 * @Description: 默认设置
 */

#ifndef __HMI_H_
#define __HMI_H_

/* ========================================================================== */
/*                             Include Files                                  */
/* ========================================================================== */
#include "Switch.h"

/* ========================================================================== */
/*                           Macros & Typedefs                                */
/* ========================================================================== */

/* ========================================================================== */
/*                         Structures and Enums                               */
/* ========================================================================== */

/* ========================================================================== */
/*                          Function Declarations                             */
/* ========================================================================== */

extern void Hmi_Init(void);
extern void Hmi_MainFunction(void);

#endif /* #ifndef __HMI_H_ */

/*EoF*/